Ran Plan for 3 projects:

1. dir: `project1` workspace: `default`
1. dir: `project2` workspace: `default`
1. dir: `terraform-gcp` workspace: `default`

### 1. dir: `project1` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -no-color -upgrade" in "/home/atlantis/.atlantis/repos/GeetaSree13/terraform_new/3/default/project1": exit status 1
Upgrading modules...
- bucket in ../terraform-gcp/modules/bucket
- service_account in ../terraform-gcp/modules/service_account
- vm in ../terraform-gcp/modules/VM
- vpc in ../terraform-gcp/modules/VPC

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Error: Failed to get existing workspaces: querying Cloud Storage failed: Get "https://storage.googleapis.com/storage/v1/b/bucket-from-terraform-sa/o?alt=json&delimiter=%2F&pageToken=&prefix=project1%2Fterraform%2Fstate%2F&prettyPrint=false&projection=full&versions=false": oauth2: cannot fetch token: 400 Bad Request
Response: {"error":"invalid_grant","error_description":"Invalid grant: account not found"}



```
</details>

---
### 2. dir: `project2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm[0].google_compute_firewall.allowing-https has been deleted
- resource "google_compute_firewall" "allowing-https" {
      - creation_timestamp = "2025-06-28T06:26:22.221-07:00" -> null
      - destination_ranges = [] -> null
      - direction          = "INGRESS" -> null
      - disabled           = false -> null
      - id                 = "projects/stable-parsec-462607-h1/global/firewalls/allowing-https" -> null
      - name               = "allowing-https" -> null
      - network            = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/networks/default" -> null
      - priority           = 1000 -> null
      - project            = "stable-parsec-462607-h1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/firewalls/allowing-https" -> null
      - source_ranges      = [
          - "0.0.0.0/0",
        ] -> null
      - target_tags        = [
          - "https-server",
        ] -> null

      - allow {
          - ports    = [
              - "443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }
  # module.vm[0].google_compute_instance.vm_instance has been deleted
- resource "google_compute_instance" "vm_instance" {
      - can_ip_forward       = false -> null
      - cpu_platform         = "Intel Broadwell" -> null
      - creation_timestamp   = "2025-06-28T06:26:23.585-07:00" -> null
      - current_status       = "RUNNING" -> null
      - deletion_protection  = false -> null
      - effective_labels     = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_display       = false -> null
      - id                   = "projects/stable-parsec-462607-h1/zones/asia-southeast1-a/instances/terraform-instance-project2" -> null
      - instance_id          = "580286892628661136" -> null
      - label_fingerprint    = "vezUS-42LLM=" -> null
      - machine_type         = "e2-medium" -> null
      - metadata_fingerprint = "1iKOvExz5H0=" -> null
      - name                 = "terraform-instance-project2" -> null
      - project              = "stable-parsec-462607-h1" -> null
      - self_link            = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/zones/asia-southeast1-a/instances/terraform-instance-project2" -> null
      - tags                 = [
          - "http-server",
          - "https-server",
        ] -> null
      - tags_fingerprint     = "6smc4R4d39I=" -> null
      - terraform_labels     = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - zone                 = "asia-southeast1-a" -> null

      - boot_disk {
          - auto_delete       = true -> null
          - device_name       = "persistent-disk-0" -> null
          - force_attach      = false -> null
          - guest_os_features = [
              - "UEFI_COMPATIBLE",
              - "VIRTIO_SCSI_MULTIQUEUE",
              - "GVNIC",
              - "SEV_CAPABLE",
              - "SEV_SNP_CAPABLE",
              - "SEV_LIVE_MIGRATABLE",
              - "SEV_LIVE_MIGRATABLE_V2",
              - "IDPF",
              - "TDX_CAPABLE",
            ] -> null
          - mode              = "READ_WRITE" -> null
          - source            = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/zones/asia-southeast1-a/disks/terraform-instance-project2" -> null

          - initialize_params {
              - architecture                = "X86_64" -> null
              - enable_confidential_compute = false -> null
              - image                       = "https://www.googleapis.com/compute/v1/projects/rocky-linux-cloud/global/images/rocky-linux-9-v20250611" -> null
              - labels                      = {} -> null
              - provisioned_iops            = 0 -> null
              - provisioned_throughput      = 0 -> null
              - resource_policies           = [] -> null
              - size                        = 20 -> null
              - type                        = "pd-standard" -> null
            }
        }

      - network_interface {
          - internal_ipv6_prefix_length = 0 -> null
          - name                        = "nic0" -> null
          - network                     = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/networks/default" -> null
          - network_ip                  = "10.148.0.3" -> null
          - queue_count                 = 0 -> null
          - stack_type                  = "IPV4_ONLY" -> null
          - subnetwork                  = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/regions/asia-southeast1/subnetworks/default" -> null
          - subnetwork_project          = "stable-parsec-462607-h1" -> null

          - access_config {
              - nat_ip       = "34.124.145.191" -> null
              - network_tier = "PREMIUM" -> null
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - availability_domain = 0 -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }
  # module.vm[0].google_compute_firewall.allowing-http has been deleted
- resource "google_compute_firewall" "allowing-http" {
      - creation_timestamp = "2025-06-28T06:26:22.203-07:00" -> null
      - destination_ranges = [] -> null
      - direction          = "INGRESS" -> null
      - disabled           = false -> null
      - id                 = "projects/stable-parsec-462607-h1/global/firewalls/allowing-http" -> null
      - name               = "allowing-http" -> null
      - network            = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/networks/default" -> null
      - priority           = 1000 -> null
      - project            = "stable-parsec-462607-h1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/stable-parsec-462607-h1/global/firewalls/allowing-http" -> null
      - source_ranges      = [
          - "0.0.0.0/0",
        ] -> null
      - target_tags        = [
          - "http-server",
        ] -> null

      - allow {
          - ports    = [
              - "80",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vm[0].google_compute_firewall.allowing-http will be created
+ resource "google_compute_firewall" "allowing-http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allowing-http"
      + network            = "default"
      + priority           = 1000
      + project            = "stable-parsec-462607-h1"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "http-server",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # module.vm[0].google_compute_firewall.allowing-https will be created
+ resource "google_compute_firewall" "allowing-https" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allowing-https"
      + network            = "default"
      + priority           = 1000
      + project            = "stable-parsec-462607-h1"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "https-server",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # module.vm[0].google_compute_instance.vm_instance will be created
+ resource "google_compute_instance" "vm_instance" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + creation_timestamp   = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "terraform-instance-project2"
      + project              = "stable-parsec-462607-h1"
      + self_link            = (known after apply)
      + tags                 = [
          + "http-server",
          + "https-server",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                 = "asia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "projects/rocky-linux-cloud/global/images/family/rocky-linux-9"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + availability_domain         = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://5c7ef9c4d3ed:4141/lock?id=GeetaSree13%252Fterraform_new%252Fproject2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project2`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 3. dir: `terraform-gcp` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/GeetaSree13/terraform_new/3/default/terraform-gcp/default.tfplan\"" in "/home/atlantis/.atlantis/repos/GeetaSree13/terraform_new/3/default/terraform-gcp": exit status 1

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.

```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
